src/InformationRegisters/ит_СоответствиеВидаЗаявкиВидуНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ит_СоответствиеВидаЗаявкиВидуНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.рздВидыЗаказовЕРП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗаказаНоменклатура</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ит_ВидыЗаявокНоменклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СегментНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ит_СоответствиеВидаЗаявкиВидуНоменклатуры/Ext/ManagerModule.bsl
Функция ПолучитьВидЗаказа_По_ВидЗаказаНоменклатура(ВидЗаказаНоменклатура) Экспорт

		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказа
		               |ИЗ
		               |	РегистрСведений.ит_СоответствиеВидаЗаявкиВидуНоменклатуры КАК ит_СоответствиеВидаЗаявкиВидуНоменклатуры
					   |ГДЕ ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказаНоменклатура = &ВидЗаказаНоменклатура";
		Запрос.УстановитьПараметр("ВидЗаказаНоменклатура",ВидЗаказаНоменклатура);
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Если Выборка.Следующий() Тогда
				Возврат Выборка.ВидЗаказа;
			КонецЕсли;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	
КонецФункции

Функция ПолучитьВидЗаказаНоменклатура_По_ВидЗаказа(ВидЗаказа) Экспорт

		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказаНоменклатура
		               |ИЗ
		               |	РегистрСведений.ит_СоответствиеВидаЗаявкиВидуНоменклатуры КАК ит_СоответствиеВидаЗаявкиВидуНоменклатуры
					   |ГДЕ ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказа = &ВидЗаказа";
		Запрос.УстановитьПараметр("ВидЗаказа",ВидЗаказа);
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Если Выборка.Следующий() Тогда
				Возврат Выборка.ВидЗаказаНоменклатура;
			КонецЕсли;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	
КонецФункции
